Ell-i/Runtime/stm32/boards.txt
#
# ELL-i software is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
# ELL-i software is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
# You should have received a copy of the GNU General Public License
# along with ELL-i software.  If not, see <http://www.gnu.org/licenses/>.
#
# For more info:
# https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification

##############################################################

ellduino.name=ELL-i Ell-duino
ellduino.vid.0=XXX
ellduino.pid.0=XXX

ellduino.upload.tool=stm32flash
ellduino.upload.protocol=stm
ellduino.upload.maximum_size=65535
ellduino.upload.speed=57600
ellduino.upload.native_usb=false

ellduino.build.mcu=cortex-m0
ellduino.build.f_cpu=48000000L
ellduino.build.core=arduelli
ellduino.build.board=STM32F051_ELLDUINO
ellduino.build.variant=ellduino
ellduino.build.variant_system_libs=-lstm32f0

ellduino.build.ldscript=ld/flash.ld
ellduino.build.extra_flags=-D__STM32F051__

##############################################################

stm32f0discovery.name=ST STM32F0discovery
stm32f0discovery.vid.0=XXX
stm32f0discovery.pid.0=XXX

stm32f0discovery.upload.tool=stflash
stm32f0discovery.upload.protocol=stm
stm32f0discovery.upload.maximum_size=65535
stm32f0discovery.upload.wait_for_upload_port=true
stm32f0discovery.upload.native_usb=true

stm32f0discovery.build.mcu=cortex-m0
stm32f0discovery.build.f_cpu=48000000L
stm32f0discovery.build.board=STM32F051_DISCOVERY
stm32f0discovery.build.core=arduelli
stm32f0discovery.build.variant=stm32f0discovery
stm32f0discovery.build.variant_system_libs=-lstm32f0

stm32f0discovery.build.ldscript=ld/flash.ld
stm32f0discovery.build.extra_flags=-D__STM32F051__
